# GetLS

## Description
Deprecated - will generate error. Use GetLSN instead.

```pascal
FUNCTION GetLS(h : HANDLE) : INTEGER;
```

```python

def vs.GetLS(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Deprecated - will generate error. Use GetLSN instead. Original description was: Returns the line style of the referenced object.

## Examples
```pascal
lStyleValue:=GetLS(handleToObject);

```

## See Also
VS Functions:
GetLSN

## Version
```diff
- GetLS is obsolete as of Vectorworks 2013
```

Availability: from MiniCAD
## Category
* Object Attributes